//////////////////////////////////////////////////////////////////////////////////
//																				//
//				МОДЕЛЬ ФИГУРЫ ЗЕМЛИ И ПОЛЯ СИЛЫ ТЯЖЕСТИ							//
//																				//
//////////////////////////////////////////////////////////////////////////////////

///////////////ФУНКЦИЯ ИНИЦИАЛИЗАЦИИ ПАРАМЕТРОВ МОДЕЛИ ЗЕМЛИ//////////////////////
//Входные параметры:
//	-	a_gd - большая полуось земного эллипсоида;
//	-	e_gd - коэффициент сжатия (экцентриситет) земного эллипсоида;
//	-	g_eq - величина ускорения свободного падения на экваторе;
//	-	e_rate - угловая скорость вращения Земли.
//Выходные параметры: нет
//////////////////////////////////////////////////////////////////////////////////

///////////////ФУНКЦИЯ РАСЧЁТА ПАРАМЕТРОВ МОДЕЛИ ЗЕМЛИ////////////////////////////
//Входные параметры:
//	-	высота над поверхностью референц-эллипсоида Красовского;
//	-	геодезическая (географическая) широта.
//Выходные параметры:
//	-	параметры фигуры Земли;
//	-	вектор напряженности поля силы тяжести в проекциях на ГССК;
//Обозначения переменных соответствуют обозначениям в файле "Уравнения ЛА в СКС (эллипсоид)"
//////////////////////////////////////////////////////////////////////////////////

#include "Matrix+Vector.h"


typedef struct {
	double A_gd;
	double G_eq;
	double Rate;
	double E_gd;
	double R_phi;
	double R_lambda;
	double R_gd;
	double phi_gr;
	Vector AcclCp_GS;
	Vector GField;
}  Earth_Struct;

void Gss_Kr_to_SK42(double x, double y, double& B42_, double& L42_);
void			EarthModelIni(double a_gd, double e_gd, double g_eq, double e_rate); //Функция инициализации параметров модели Земли
Earth_Struct	GetEarthParameters(double H, double B);  //Функция расчёта параметров модели Земли